# FROM golang:latest  

# #Установить директорию в которую мы положим все файлы нашего проекта
# WORKDIR /develop

# #Скопировать все зависимости
# COPY go.mod go.sum ./
# RUN go mod download

# #Скопируем в WORKDIR все файлы нашего проекта
# COPY . .
# #Порт, на который будем слать запросы
# EXPOSE 50052
# #Команда для создания .exe файла. Путь к нему в контейнере: ./main. И путь к нему явно: ./cmd/main
# RUN CGO_ENABLED=0 GOOS=linux go build -o ./main ./cmd/main
# #Запуск .exe файла 
# CMD ["/develop/main"]

# #Чтобы запустить контейнер с образом, нужно прописать: docker run -d --rm -p 9000:50052 sg/grpc-go

FROM golang:1.25-alpine AS builder
#Установка необходимых пакетов внутри сырой версии golang
RUN apk add --no-cache git make
#Установить директорию в которую мы положим все файлы нашего проекта
WORKDIR /app
#Скопировать все зависимости
COPY go.mod go.sum ./

RUN go mod download

COPY . .
#Для production среды забилдим образ максимально легковесный
RUN CGO_ENABLED=0 GOOS=linux go build \
#Ниже представлен флаг линкера. В целом линкер это инструмент языка, который объединяет объектные файлы в один исполняемый.
#Чтобы облегчить и обезопасить сборку ДЛЯ PRODUCTION СРЕДЫ используются флаги:
# `-W` - позволяет убрать информацию о дебаге
# `-s` - отключает таблицу символов (symbol table). Эта структура, содержащая инфу о всех функциях, переменных и тд, которые использует программа
#Таблица символов позволяет делать удобную отладку, однако без неё я в отладчике буду видеть только адреса без названий переменных, функций и тд.
    -ldflags "-W -s" \
#Ниже представлен полный путь, куда будет скопирован сервис:
    -o /app/bin/orderservice \
#Это путь к исходному файлу, который нужно скопировать:
    ./cmd/main/main.go

#Теперь пропишем вторую фазу сборки докер-образа





